app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.create(permit_params(:title, :room_number))
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 10], ["created_at", "2020-10-29 22:08:48.860434"], ["updated_at", "2020-10-29 22:08:48.860434"]]

    def update
        @school_class = SchoolClass.find(params[:id])
        @school_class.update(permit_params(:title, :room_number))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Psychology"], ["updated_at", "2020-10-29 22:14:05.434737"], ["id", 1]]