app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["created_at", "2020-10-29 22:18:45.086541"], ["updated_at", "2020-10-29 22:18:45.086541"]]
---
    def create
        @student = Student.create(permit_params(:first_name, :last_name))